# SecurityDatasets GoldenSAML Microsoft365DefenderEvents.json to OSCF mapping


time: Timestamp


# endpoint: see https://schema.ocsf.io/1.1.0/objects/endpoint
device: &endpoint
    hostname: DeviceName
    uid: DeviceId


file: &file
    endpoint: *endpoint
    name: FileName


# https://schema.ocsf.io/1.1.0/objects/process
process:
    endpoint: *endpoint
    cmd_line: ProcessCommandLine
    pid: ProcessId
    uid: ProcessId
    hash:
        md5: MD5
        sha1: SHA1
        sha256: SHA256


actor:
    process:
        endpoint: *endpoint
        cmd_line: InitiatingProcessCommandLine
        pid: InitiatingProcessId
        uid: InitiatingProcessId
        parent_process:
            endpoint: *endpoint
            pid: InitiatingProcessParentId
            uid: InitiatingProcessParentId
            file:
                name: InitiatingProcessParentFileName
        file:
            name: InitiatingProcessFileName
            path: InitiatingProcessFolderPath
            hash:
                md5: InitiatingProcessMD5
                sha1: InitiatingProcessSHA1
                sha256: InitiatingProcessSHA256
            parent_folder:
                native_field: InitiatingProcessFolderPath
                native_op: LIKE
                native_value: winpath_startswith
                ocsf_value: dirname
    user:
        endpoint: *endpoint
        uid: InitiatingProcessAccountSid
        name: InitiatingProcessAccountName
        domain: InitiatingProcessAccountDomain


# src_endpoint: see https://schema.ocsf.io/1.1.0/objects/endpoint
src_endpoint:
    ip: IPAddress
    port: Port


# dst_endpoint: see https://schema.ocsf.io/1.1.0/objects/endpoint
dst_endpoint:
    hostname: DestinationDeviceName
    ip: DestinationIPAddress
    port: DestinationPort


# https://schema.ocsf.io/1.1.0/objects/user
user:
    domain: AccountDomain
    name: AccountName
    uid: AccountSid


# https://schema.ocsf.io/1.1.0/objects/http_request
http_request:
    user_agent: UserAgent


# https://schema.ocsf.io/1.1.0/objects/query_info
query_info:
    uid: ReportId
    attr_list: AdditionalFields.AttributeList
    search_filter: AdditionalFields.SearchFilter


# https://schema.ocsf.io/1.1.0/objects/managed_entity
entity:
    uid: ReportId
    data: ActivityObjects


# https://schema.ocsf.io/1.2.0/classes/user_access
privileges: Permissions


# https://schema.ocsf.io/1.1.0/classes/base_event
# Base Event
type_uid:
    native_field: ActionType
    native_value:
        300403: # Entity Management: Update
            - "MailItemsAccessed"
        300501: # User Access Management: Assign Privileges
            - "Add delegated permission grant."
        600504: # Datastore Activity: Query
            - "LdapSearch"
        600599: # Datastore Activity: Other
            - "Directory Services replication"

type_name: ActionType

status_id:
  - native_field: RawEventData.ResultStatus
    native_value:
        1: # Success
            - "Succeeded"
        2: # Failure
            - "Failed"
